from package.skills.core import speak
import datetime
import sys

hour = int(datetime.datetime.now().hour)

def Greeting():
    if hour >= 0 and hour < 12:
        speak.Speak('Як не дивно, але Доброго ранку')
        print('Як не дивно, але Доброго ранку')
    elif hour>=12 and hour<18:
        speak.Speak('День добрий')
        print('День добрий')
    else:
        speak.Speak('Вечір в хату')
        print('Вечір в хату')

def Bye():
    speak.Speak('До зустрічі')
    print('До зустрічі')
    sys.exit()

def Thank():
    speak.Speak('прошу, чим займемся дальше?')

def List():
    speak.Speak('Ось список моїх можливостей')
    print('Ось список моїх можливостей')
    list_dict={
        'Додати замітку':['додати задачу', 'додати замітку'],
        'Включити музику': ['музика', 'включи музику', 'музику'],
        'Відкрити вікіпедію': ['включи вікіпедію', 'вікіпедія'],
        'Пошук відео': ['включи відео', 'пошук відео', 'відео'],
        'Пошук у браузері': ['відкрий браузер', 'хром','браузер','пошук'],
        'Погода': ['погода', 'яка зараз погода'],
        'Погода на завтра':['яка завтра погода', 'пророцтво','що буде завтра'],
        'Вказати на час': ['яка година', 'котра година'],
        'Калькулятор':['калькулятор','відкрий калькулятор'],
        'Міні-гра':['час гри','гра'],
        'Скрін екрана':['зроби фото',' зроби скрін','екран'],
        'Розказати жарт':['анекдот','розкажи анекдот'],
        'Розказати історію':['розкажи історію','історія'],
        'Цікаві факти':['розкази факт','факт'],
        }
    for p,o in list_dict.items():
        print(f'{p} : {o}')
    
    
